## Pandas DataFrame

In [1]:
import numpy as np
import pandas as pd

### DataFrame

# Missing Data

Let's see a few convenient methods to deal with Missing Data in pandas:

In [2]:
df = pd.read_csv('df11.csv')

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [6]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [8]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [10]:
df.iloc[1] = df.iloc[1].fillna(value=df.iloc[1].mean())
df.iloc[1]

A    2.0
B    2.0
C    2.0
Name: 1, dtype: float64

In [11]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  2.0  2.0
2  1.5  NaN  3.0

In [12]:
df['B'] = df['B'].fillna(value=df['B'].mean())
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  2.0  2.0
2  1.5  3.5  3.0

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [2]:
df = pd.read_csv('df12.csv')
df

   A    B    C
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

In [3]:
df.iloc[0][0]

1

In [4]:
df['A'][0]

1

### Info on Unique Values

In [14]:
df['B'].unique()

array([444, 555, 666], dtype=int64)

In [15]:
# No. of unique values
len(df['B'].unique())

3

In [16]:
df['B'].nunique()

3

In [17]:
df['B'].value_counts()

444    2
555    1
666    1
Name: B, dtype: int64

### Selecting Data

In [18]:
df['A']>2

0    False
1    False
2     True
3     True
Name: A, dtype: bool

In [19]:
df[df['A']>2]

   A    B    C
2  3  666  ghi
3  4  444  xyz

In [20]:
df[(df['A']>2) & (df['B']==444)]

   A    B    C
3  4  444  xyz

### Applying Functions

In [21]:
def times2(x):
    return x*2

In [22]:
df['A'].apply(times2)

0    2
1    4
2    6
3    8
Name: A, dtype: int64

In [23]:
#Applying inbuit operator
df['C'].apply(len)

0    3
1    3
2    3
3    3
Name: C, dtype: int64

In [24]:
df['A'].sum()

10

** Permanently Removing a Column**

In [25]:
del df['A']

In [26]:
df

     B    C
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

** Get column and index names: **

In [27]:
df.columns

Index(['B', 'C'], dtype='object')

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [29]:
df

     B    C
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

In [30]:
df.sort_values(by='B') #inplace=False by default

     B    C
0  444  abc
3  444  xyz
1  555  def
2  666  ghi

** Find Null Values or Check for Null Values**

In [31]:
df.isnull()

       B      C
0  False  False
1  False  False
2  False  False
3  False  False

##### &&&&&